(defvar title "À«Ì¾È½ÃÇ    for NEmacs/Mule. (C) yoshinov@etl.go.jp")
(defvar version "ver 2.0 (1995.3)")
(defvar patches1 "add seimei-region by akiba@aa.cs.keio.ac.jp")
(defvar patches2 "for mule version by yoichi@esasd.ksp.fujixerox.co.jp")
(defvar patches3 "for ne/mu version by ksakai@mtl.t.u-tokyo.ac.jp")
(defvar original "À«Ì¾È½ÃÇ version 1.02 Copyright(C) 1991 S.Ameno, ÂôÅÏ¹áÀ¡")
;;
;; À«Ì¾È½ÃÇ for NEmacs/Mule version. by yoshinov@etl.go.jp
;;
;; 1. How to setup....(ÀßÄêÊıË¡)
;;     ¤¢¤Ê¤¿¤Î.emacs¤Ë°Ê²¼¤Î°ì¹Ô¤òÆş¤ì¤Æ¤¯¤À¤µ¤¤¡£
;; (autoload 'seimei "seimei" "seimei" t)
;; ¤â¤Á¤í¤ó¡¢load-path¤Ç¸¡º÷¤Ç¤­¤ë¥Ç¥£¥ì¥¯¥È¥ê¤Ëseimei.el¤òÆş¤ì¤Æ¤¯¤À¤µ¤¤¡£
;;
;; 2. How to use......(»ÈÍÑÊıË¡) ¼¡¤Î»°ÄÌ¤ê¤Ç¤¹¡£
;; a)
;;    M-x seimei
;; b)
;;    À«¤ÈÌ¾¤Î´Ö¤Ë¶õÇò¤ò¤¢¤±¤Æ½ñ¤­¡¢¤½¤³¤Ëregion¤òÀßÄê¤·¤Æ¤«¤é
;;    M-x seimei-region
;;
;;    ¤¿¤À¤·¡¢seimei.el¤ò°ìÅÙÆÉ¤ß¹ş¤ó¤Ç¤ª¤¯¤«¡¢.emacs¤Ë
;;    (autoload 'seimei-region "seimei" "seimei" t)
;;    ¤È½ñ¤­¹ş¤ó¤Ç¤ª¤¯É¬Í×¤¬¤¢¤ê¤Ş¤¹¡£Ï·ÇÌ¿´¤Ê¤¬¤é¡Ä:-)
;; c)
;;    À«¤ÈÌ¾¤Î´Ö¤Ë¶õÇò¤ò¤¢¤±¤Æ°ì¹Ô¤Ë°ì¿Í¤Å¤Ä½ñ¤­¤Ş¤¹¡£¥¦¥ì¥·¥Ï¥º¥«¥·¡ª
;;    M-x seimei-buffer
;;
;;    ¤¿¤À¤·¡¢seimei.el¤ò°ìÅÙÆÉ¤ß¹ş¤ó¤Ç¤ª¤¯¤«¡¢.emacs¤Ë
;;    (autoload 'seimei-buffer "seimei" "seimei" t)
;;    ¤È½ñ¤­¹ş¤ó¤Ç¤ª¤¯É¬Í×¤¬¤¢¤ê¤Ş¤¹¡£ºÆ¤Ó¡¢Ï·ÇÌ¿´¤Ê¤¬¤é¡Ä:-)
;;
;; 3. Bugs and other info.
;;   seimei.c ¤È¤Ï¡¢ÆÀÅÀ¤Î·×»»ÀºÅÙ¤¬°Û¤Ê¤ê¤Ş¤¹¡£el¤ÇÉâÆ°¾®¿ôÅÀ¤Ï¡Ä(;_;)
;;   Ê¸»ú¤¬80²è°Ê¾å¤ÎÌ¾Á°¤Ï1²è¤ËÌá¤ê¤Ş¤¹¡£
;;   ´Á»ú²è¿ô¼­½ñbuffer¤Ï¡¢½ªÎ»»ş¤Ë¤âkill-buffer¤µ¤ì¤Ş¤»¤ó¡£(for ºÆÍøÍÑ)
;;   byte-compile¤¹¤ë¤Èseimei.elc¤Ïmule¸ÇÄê¤¢¤ë¤¤¤Ïnemacs¸ÇÄê¤Ë¤Ê¤ê¤Ş¤¹¤Î¤Ç¡¢
;;   mule¤Ènemacs¤ò¶¦Â¸¤µ¤»¤Æ¤¤¤ëÊı¤Ï¸æÎ±°Õ²¼¤µ¤¤¡£(by yoichi)
;;
;; 3.1 À«Ì¾È½ÃÇ¤Ë¤ÏÎ®ÇÉ¤¬¤¤¤í¤¤¤í¤¢¤ë¤±¤É¡Ä¡©
;;
;;   ´Á»ú¤Î²è¿ô¤Î¿ô¤¨Êı¼«ÂÎ¤¬Î®ÇÉ¤Ë¤è¤Ã¤Æ°Û¤Ê¤ë¤è¤¦¤Ç¤¹¡£¤Ş¤¿¡¢¤¢¤ëÎ®ÇÉ¤ÎµÈ
;;   ¿ô¤¬ÊÌ¤ÎÎ®ÇÉ¤ÎÂç¶§¿ô¤Ë¤Ê¤Ã¤¿¤ê¤¹¤ë¤è¤¦¤Ç¤¹¡£Å·ÃÏÆ±²è¤Ø¤ÎÃí°Õ¤â¡¢±¢ÍÛ¥Ğ
;;   ¥é¥ó¥¹¤â¡¢¸Ş¹Ô¤â¡¢²»´¶¤â¤Ê¤¤¡¢¤È¤¤¤¦¤³¤È¤Ç¡¢ËÜÅö¤Ëµ¤¤Ë¤·¤Æ¤¤¤ë¿Í¤ÏËÜ¤ò
;;   ¤ªÆÉ¤ß¤Ë¤Ê¤ë¤«¡¢ÀìÌç¤ÎÊı¤Ë¸«¤ÆÄº¤¯¤³¤È¤ò¤ª´«¤á¤·¤Ş¤¹¡£¤¿¤À¡¢ËÜ¥×¥í¥°¥é
;;   ¥à¤Ï¾®ÅçÇòÍÌÀèÀ¸¤Î²ò¼á¤Ë¤è¤ë¤â¤Î¤Ç¤¹¡£
;;
;;   »²¹Í¡¡À«Ì¾È½ÃÇÆşÌç¡¡¥Ê¥Ä¥á¼Ò¡¡Äê²Á£±£°£±£°±ß¡ÊËÜÂÎ£¹£¸£±±ß¡Ë
;;
;;   ---- °Ê²¼¡¢ÂôÅÏ¹áÀ¡¤µ¤ó¤Îºî¤é¤ì¤¿seimei.doc¤è¤êÅ¾ºÜ¤Ç¤¹¡£ ---
;;   ¤Ê¤ª¡¢É½¼¨¥á¥Ã¥»¡¼¥¸¤ÎÃøºî¸¢¼Ô¤Ç¤¢¤ë¾®ÅçÇòÍÌÀèÀ¸¤ÎÏ¢ÍíÀè¤Ï
;;   ¼¡¤Î¤È¤ª¤ê¤Ç¤¹¡£(ÀèÀ¸¸æËÜ¿Í¤Î´õË¾¤Ë¤è¤êÌÀ¼¨¤·¤Æ¤¤¤Ş¤¹)
;;   ¿ÀÆàÀî¸©»°±º·´ÍÕ»³Ä®ËÙÆâ1950-10  ¢©240-01    0468-75-2933
;;   -------------------------------------------------------------
;;
;;   ¤Ê¤ª¡¢´Á»ú¤Î²è¿ô¤Ë´Ø¤·¤Æ¤Ï¸æ¼«¿È¤Ç¼êÄ¾¤·¤¹¤ë¤³¤È¤¬½ĞÍè¤Ş¤¹¡£seimei.el
;;   ¤Î¸åÈ¾ÉôÊ¬¤Ï²è¿ô¼­½ñ¤Ë¤Ê¤Ã¤Æ¤ª¤ê¤Ş¤¹¤¬¡¢²è¿ô¤¬ÊÑ²½¤¹¤ë¤´¤È¤Ë\n¤¬¤¯¤ë¤è
;;   ¤¦¤Ë¤Ê¤Ã¤Æ¤¤¤Ş¤¹¡£¤Ç¤¹¤«¤é¡¢Îã¤¨¤Ğdefault¤Ç£´²è¤Î¡Ö¸Ş¡×¤ò£µ²è¤ËÊÑ¹¹¤·
;;   ¤¿¤¤¡¢¤È¤¤¤¦¤³¤È¤Ç¤¢¤ì¤Ğ¡¢\n¤ò¤Ò¤È¤Ä±Û¤¨¤¿¤È¤³¤í¤Ë°ÜÆ°¤µ¤»¤ì¤Ğ¤è¤¤¤ï¤±
;;   ¤Ç¤¹¡£
;;
;; 3.2 ±ÑÊ¸»ú¤òÆş¤ì¤ë¤ÈÅ·È³¤¬²¼¤ë¡Ä¡£
;;   ver 1.03em ¤è¤ê¡¢ÇË¼Ù¤Îµ§Åø¤òÃ×¤·¤Ş¤·¤¿¤Î¤ÇÅ·È³¤Ï²¼¤ê¤Ş¤»¤Ì¡£
;;
;;   ¥¨¥é¡¼¤¬½Ğ¤¿¾ì¹ç¤Ë¤Ï¤ªÃÎ¤é¤»²¼¤µ¤¤¡£

(defvar Seimei-Buffer "*À«Ì¾È½ÃÇ*" "Buffer name for À«Ì¾È½ÃÇ")
(defvar Seimei-Kanji-Kakusuu-Dic-Buffer " *´Á»ú²è¿ô¼­½ñ*"
  "Buffer name for ´Á»ú²è¿ô¼­½ñ*")
(defvar Float-Buffer " *ÉâÆ°¾®¿ôÅÀ±é»»ÍÑ*"
  "Buffer name for ÉâÆ°¾®¿ôÅÀ±é»»ÍÑ*")
(defvar Seimei-TMPBUFFER " *SEIMEI-tmpbuf*"
  "Buffer name for Ê¸»úÎó¤ÎÄ¹¤µ·×»»ÍÑ*")
(defvar seimei-char-width (length "¤¢") "ÆüËÜ¸ìÊ¸»ú¤ÎÂç¤­¤µ")
(defconst seimei-erase-buffer t "À«Ì¾È½ÃÇ¤Î·ë²Ì¤ò¡¢Ëè²ó¾Ãµî¤¹¤ë»ş¤Ë¤Ït")

;;;###autoload
(defun seimei-buffer ()
  (interactive)
  (save-excursion
    (let ((cbuf (current-buffer))
	  (seimei-erase-buffer nil))
      (set-buffer (get-buffer-create Seimei-Buffer))
      (erase-buffer)
      (insert (format "%s\n\t\t\t\t\t%s\n" title version))
      (set-buffer cbuf)
      (goto-char (point-min))
      (while (re-search-forward "^[^ ]* [^ \n]*$" nil t)
	(seimei-region (match-beginning 0) (match-end 0))))))

;;;###autoload
(defun seimei-region (start end)
  (interactive "r")
  (save-excursion
    (goto-char start)
    (if (search-forward " " end t)
	(seimei (buffer-substring start (match-beginning 0))
		(buffer-substring (match-end 0) end))
      (error "Please Set Region on @À«<SPC>Ì¾@"))))

;;;###autoload
(defun seimei (sei mei)
  "À«Ì¾È½ÃÇ¤ò¹Ô¤¤¤Ş¤¹¡£"
  (interactive "SÀ«Ì¾È½ÃÇ:¡ÖÀ«¡×¤ò¤É¤¦¤¾>\nS¼¡¤Ë¡ÖÌ¾¡×¤ò¤É¤¦¤¾>")
  (setup-dic) ;¼­½ñ¥Ğ¥Ã¥Õ¥¡¤ÎÀßÄê
;  (my-debugger-setup)
  (catch 'globaltag nil
	 (let ((res (get-buffer-create Seimei-Buffer))
	       (dic (get-buffer Seimei-Kanji-Kakusuu-Dic-Buffer))
	       (seimeilist nil)(seimeilen nil)(seimeikaku nil)(tmpkaku nil)
	       (tmp 0)(point0 0)(point1 0)(point2 0)(point3 0)(point4 0)
	       (orgtmp 0)(smsum 0)(slc 0)(lc 0))
	   (setq seimeilist (list (format "%s" sei) (format "%s" mei)))
	   (setq seimeilen (list (strlen sei) (strlen mei)))
	   (set-buffer dic)
	   (while (< slc 2) ;À«¤ÈÌ¾¤Ç2²ó¥ë¡¼¥×¤¹¤ë¡£
	     (while (not (eq (car seimeilen) lc))
	       (goto-char (point-min))
	       (if (search-forward
		    (substring (car seimeilist) lc
			       (+ lc seimei-char-width)) (point-max) t)
		   (setq tmpkaku (append tmpkaku
					 (list (count-lines (point-min)
							    (point)))))
		 (progn
		   (seimei-sorry-poor-dic sei mei
		    (substring (car seimeilist) lc (+ lc seimei-char-width)))
		   (throw 'globaltag nil)))
	       (setq lc (+ lc seimei-char-width)))
	     (setq seimeilist (cdr seimeilist));Ì¾¤ò¥»¥Ã¥È¡£
	     (setq seimeilen (cdr seimeilen)) ;Ì¾(¤ÎÄ¹¤µ)¤ò¥»¥Ã¥È¡£
	     (setq seimeikaku (append seimeikaku (list tmpkaku)))
	     (setq tmpkaku nil)
	     (setq lc 0)
	     (setq slc (1+ slc)))
	   (setq smsum ;À«²è¿ô¹ç·×¤ÈÌ¾²è¿ô¹ç·×¤ò¥ê¥¹¥È¤Ë³ÊÇ¼¡£
		 (list (addcell (car seimeikaku))
		       (addcell (car (cdr seimeikaku)))))
	   
	   (setup-float-buffer)
	   
	   (set-buffer res)
	   (if seimei-erase-buffer
	       (progn
		 (erase-buffer)
		 (insert (format "%s\n\t\t\t\t\t%s\n" title version)))
	     (insert "\n"))
	   (insert (format "***** %s %s *****\n" sei mei))
	   (setq tmp (+ (car smsum)(car (cdr smsum))))
	   (setq orgtmp tmp)
	   (while (< 80 tmp) (setq tmp (- tmp 80)))
	   (setq point0 (car (cdr (nth tmp unsei))))
	   (insert (format "Áí±¿ %2d²è Áí¹ç  \t %s\n" orgtmp (car (nth tmp unsei))))
	   (setq tmp (car smsum))
	   (setq orgtmp tmp)
	   (while (< 80 tmp) (setq tmp (- tmp 80)))
	   (setq point1 (car (cdr (nth tmp unsei))))
	   (insert (format "Å·±¿ %2d²è ÀèÁÄ±¿\t %s\n" orgtmp (car (nth tmp unsei))))
	   (setq tmp (car (cdr smsum)))
	   (setq orgtmp tmp)
	   (while (< 80 tmp) (setq tmp (- tmp 80)))
	   (setq point2 (car (cdr (nth tmp unsei))))
	   (insert (format "ÃÏ±¿ %2d²è ¸ÄÀ­  \t %s\n" orgtmp (car (nth tmp unsei))))
	   (setq tmp (+ (car (reverse (car seimeikaku)))(car (car (cdr seimeikaku)))))
	   (setq orgtmp tmp)
	   (while (< 80 tmp) (setq tmp (- tmp 80)))
	   (setq point3 (car (cdr (nth tmp unsei))))
	   (insert (format "¿Í±¿ %2d²è ¼Ò²ñÀ­\t %s\n" orgtmp (car (nth tmp unsei))))
	   (setq tmp (+ (if (null (cdr (reverse (car seimeikaku))))
			    (car (car seimeikaku))
			  (addcell (cdr (reverse (car seimeikaku)))))
			(if (null (cdr (car (cdr seimeikaku))))
			    (car (car (cdr seimeikaku)))
			  (addcell (cdr (car (cdr seimeikaku)))))))
	   (setq orgtmp tmp)
	   (while (< 80 tmp) (setq tmp (- tmp 80)))
	   (setq point4 (car (cdr (nth tmp unsei))))
	   (insert (format "³°±¿ %2d²è ´Ä¶­±¿\t %s\n" orgtmp (car (nth tmp unsei))))
	   (insert (format "Áí±¿+¿Í±¿ "))
	   (insert-power (* point0 point3) Pow1/2-7)
	   (insert (format "  Å·±¿+ÃÏ±¿+³°±¿ "))
					;    (debugger-insert (format "1 %s 2 %s 4 %s = %s" point1 point2 point4 (* (* point1 point2) point4) ))
	   (insert-power (* (* point1 point2) point4) Pow1/3-3)
	   (insert (format "  ÆÀÅÀ " ))
	   (insert-float-add)
	   (display-buffer res)
;	   (delete-other-windows (selected-window))
;	   (set-window-buffer (split-window (selected-window)) res)
	   (seimei-fin))))

(defun insert-float-add ()
  (let ((afbuf (get-buffer Float-Buffer))
	(cbuf (current-buffer))(tmp 0)(upper 0)(lower 0))
    (set-buffer afbuf)
    (goto-char (point-min))
    (if (> (string-to-int emacs-version) 18)
	(progn
	  (set-buffer cbuf)
	  (setq tmp (number-to-string (+ (read afbuf) (read afbuf))))
	  (string-match "[^\\.]*\\.." tmp)
	  (insert (substring tmp (match-beginning 0) (match-end 0))))
      (setq tmp (read afbuf))
      (forward-line 1)
      (setq upper (+ tmp (read afbuf)))
      (goto-char (point-min))
      (read afbuf)
      (setq tmp (read afbuf))
      (read afbuf)
      (setq lower (+ tmp (read afbuf)))
      (if (< 9 lower)
	  (progn
	    (setq upper (1+ upper))
	    (setq lower (- lower 10))))
      (set-buffer cbuf)
      (insert (format "%s.%s\n" upper lower)))))

(defun setup-float-buffer ()
  (save-excursion
    (let ((tmp (get-buffer-create Float-Buffer)))
      (set-buffer tmp)
      (erase-buffer))))

(defun insert-power (num var)
  "var = Pow1/2-7 : sqrt(num) * 0.7¤È¤¤¤¦±é»»¤Î·ë²Ì¤òC¥Ğ¥Ã¥Õ¥¡¤Ë½ĞÎÏ¡£
   var = Pow1/3-3 : pow(num, 1/3) * 0.3¤È¤¤¤¦±é»»¤Î·ë²Ì¤òC¥Ğ¥Ã¥Õ¥¡¤Ë½ĞÎÏ¡£
   ¹¹¤Ë¡¢²Ã»»¥Ğ¥Ã¥Õ¥¡¤Ë¤â½ĞÎÏ¤¹¤ë¡£"
  (interactive "P")
  (let ((afbuf (get-buffer-create Float-Buffer))
	(flag t))
    (while flag
      (if (eq (car var) nil)
	  (setq flag nil)
	(if (eq (car (car var)) num)
	    (progn
	      (insert (format "%s" (car (cdr (car var)))))
	      (insert-string-to-buffer afbuf
				       (format "%s\n" (car (cdr (car var)))))
	      (setq flag nil))
	  (setq var (cdr var)))))))

(defun insert-string-to-buffer (buf str)
  (interactive "P")
  (save-excursion
    (set-buffer buf)
    (insert str)))

(defun addcell (lst)
  "lst¤ËÍ¿¤¨¤é¤ì¤¿¥ê¥¹¥È¤ÎÍ×ÁÇ¤òÁ´¤Æ¹ç·×¤·¤Ş¤¹¡£"
  (let ((tmp 0))
    (mapcar (function (lambda (n) (setq tmp (+ tmp n)))) lst)
    tmp))

(defun seimei-sorry-poor-dic (sei mei notfound)
  (let ((res (get-buffer Seimei-Buffer)))
    (set-buffer res)
    (erase-buffer)
    (insert (format "%s\n\t\t\t\t\t%s\n" title version))
    (insert (format "***** %s %s *****\n\n" sei mei))
    (insert (format "°Û¹ñÊ¸»ú¡Ö%s¡×¤ò´Ş¤ó¤ÀÌ¾Á°¤ÏÈ½ÃÇ¤·¤«¤Í¤Ş¤¹¡Ä¡£¤¢¤·¤«¤é¤º¡£\n" notfound))
    (delete-other-windows (selected-window))
    (set-window-buffer (split-window (selected-window)) res)))

(defun seimei-fin ()
  (let ((tmp (get-buffer Seimei-TMPBUFFER))
	(afc (get-buffer Float-Buffer)))
    (kill-buffer tmp)
    (kill-buffer afc)))

(defun seimei-quit ()
  (let ((res (get-buffer Seimei-Buffer))
	(dic (get-buffer Seimei-Kanji-Kakusuu-Dic-Buffer))
	(dbg))
    (seimei-fin)
    (kill-buffer res)
    (kill-buffer dic)
    (if (get-buffer "*debugger*")
	(kill-buffer (get-buffer "*debugger*")))))

(defun no-error-forward-char (num)
  (if (not (= (point) (point-max)))
      (forward-char num)))

(defun setup-dic ()
  "´Á»ú²è¿ô¼­½ñ¤òÀßÄê¤·¤Ş¤¹¡£´û¤ËÆ±Ì¾¤Î¥Ğ¥Ã¥Õ¥¡¤¬¤¢¤ë»ş¤Ë¤ÏºÆÍøÍÑ¤·¤Ş¤¹¡£"
  (if (not (get-buffer Seimei-Kanji-Kakusuu-Dic-Buffer))
      (let ((dic (get-buffer-create Seimei-Kanji-Kakusuu-Dic-Buffer))
	    (sklist Seimei-Kaku-list))
	(set-buffer dic)
	(while sklist
	  (insert (format "%s" (car sklist)))
	  (setq sklist (cdr sklist)))
	(setq buffer-read-only t))))

(defun strlen (str)
  "Ê¸»úÎó¤ÎÄ¹¤µ¤ò¿ô¤¨¤Ş¤¹¡£"
  (interactive "P")
  (save-excursion
    (let ((tmpbuf (get-buffer-create Seimei-TMPBUFFER)))
      (set-buffer tmpbuf)
      (erase-buffer)
      (insert (format "%s" str))
      (1- (point-max)))))

;(defun new-get-buffer-create (buf)
;  "´û¤ËÆ±Ì¾¤Î¥Ğ¥Ã¥Õ¥¡¤¬¤¢¤ë¤È¤­¤Ë¤Ï¡¢¤½¤ì¤ò¾Ã¤·¤Æ¤«¤éºî¤êÄ¾¤·¤Ş¤¹¡£"
;  (interactive "P")
;  (if (not (eq (get-buffer buf) nil))
;      (kill-buffer buf))
;  (get-buffer-create buf))

(defun my-debugger-setup ()
  "¼«Ê¬¤Ç¤Ä¤¯¤é¤Ê¡¢¤¢¤«¤ó¤È¤Ï¡Ä¡£"
  (save-excursion
    (let ((tmp (get-buffer-create "*debugger*")))
      (set-buffer tmp)
      (erase-buffer))))

(defun debugger-insert (str)
  "Ê¸»úÎó¤ò°ú¿ô¤Ë¤È¤Ã¤Æ¡¢*debugger* buffer¤Ë½ñ¤­½Ğ¤¹¡£"
  (interactive "P")
  (save-excursion
    (let ((debugger (get-buffer "*debugger*")))
      (set-buffer debugger)
      (insert str))))

(defvar Pow1/2-7 '( (25 "3.5") (50 "5.0") (100 "7.0")
		   (200 "9.9") (400 "14.0") (500 "15.7")
		   (800 "19.8") (1000 "22.1") (1600 "28.0")
		   (3200 "39.6") (4000 "44.3") (6400 "56.0")
		   (8000 "62.6") (10000 "70.0")))

(defvar Pow1/3-3 '( (125 "1.5") (250 "1.9") (500 "2.4")
		  (1000 "3.0") (2000 "3.8") (2500 "4.1")
		  (4000 "4.8") (5000 "5.1") (8000 "6.0")
		  (10000 "6.5") (16000 "7.6") (20000 "8.1")
		  (32000 "9.5") (40000 "10.3") (50000 "11.1")
		  (64000 "12.0") (80000 "12.9") (100000 "13.9")
		  (128000 "15.1") (160000 "16.3") (256000 "19.0")
		  (320000 "20.5") (400000 "22.1") (512000 "24.0")
		  (640000 "25.9") (800000 "27.8") (1000000 "30.0")))

(defvar unsei '(
	("" 100)
	("Àª¤¤¤Î¤¢¤ëµÈ¿ô" 80)
	("ÊÌÎ¥¤ò¤·¤¤¤é¤ì¤ë¶§¿ô" 10)
	("Ä´ÏÂ¤È°ÂÄê¤ÎµÈ¿ô" 80)
	("ÇËÌÇ¤Î¿ÍÀ¸¤ò¾·¤¯¶§¿ô" 10)
	("¶Ñ¹Õ¤òÆÀ¤ëµÈ¿ô" 80)
	("·Ã¤ß¤ËËş¤Á¤¿µÈ¿ô" 80)
	("ÇÈÍğ¤ò¹î¤¹¤ëÍ¦ÌÔ¤ÎµÈ¿ô" 80)
	("Ç¦ÂÑ¤¬È¯Å¸¤òÀ¸¤àµÈ¿ô" 80)
	("ÉÔ¶ø¤È¸ÉÆÈ¤ò°Å¼¨¤¹¤ë¶§¿ô" 10)
	("¤¹¤Ù¤Æ¤¬¶õÇù¤Ëµ¢¤¹¤ëÂç¶§¿ô" 5)
	("¤¿¤¯¤Ş¤·¤¤À®Ä¹¤ò¿ë¤²¤ëµÈ¿ô" 80)
	("°Õ»ÖÇö¼å¤ÇºÃÀŞ¤¹¤ë¶§¿ô" 10)
	("ºÍÇ½¤Ë·Ã¤Ş¤ì¤¿µÈ¿ô" 80)
	("¶ìÏ«¤ÎÂ¿¤¤Èó±¿¤Î¶§¿ô" 10)
	("Ãå¡¹¤ÈÈ¯Å¸¤¹¤ëµÈ¿ô" 80)
	("·Ã¤Ş¤ì¤¿¶­¶ø¤òÆÀ¤ëµÈ¿ô" 80)
	("¹äµ£¤Çµ¤Ç÷¤Î¤¢¤ëµÈ¿ô" 80)
	("ºÍÃÎ¤È¹ÔÆ°ÎÏ¤ËÉÙ¤àµÈ¿ô" 80)
	("Ì¤´°¤ÎÂç´ï¤Ë½ª¤ï¤ëÈ¾µÈ¿ô" 40)
	("ÇËÃ¾¤È¸É½¥¤Î¶§¿ô" 10)
	("ÆÈÎ©¤È¸ùÌ¾¤ÎµÈ¿ô" 80)
	("ÌµÎÏ´¶¤ËÇº¤Ş¤µ¤ì¤ë¶§¿ô" 10)
	("Ä«Æü¤¬¾º¤ëÀª¤¤¤ÎµÈ¿ô" 80)
	("¿Í¤ÈÊª¤Ë·Ã¤Ş¤ì¤ëÂçµÈ¿ô" 100)
	("¾¡µ¤¤Ë²á¤®¤ÆÂ»¤¹¤ëÈ¾µÈ¿ô" 40)
	("ÇÈÍğ¤È°ÛÊÑ¤Î¶§¿ô" 10)
	("¶¯¾ğ¤¬ÉÔ±¿¤ò¾·¤¯È¾µÈ¿ô" 40)
	("ÊÑ¿Í´ñ±¿¤ÎÂç¶§¿ô" 5)
	("µõ±É¤¬ºÒ¤¤¤¹¤ëÈ¾µÈ¿ô" 40)
	("»îÎı¤¬À¹¿ê¤ò·è¤á¤ëÈ¾µÈ¿ô" 40)
	("·ø¼Â¤ËÀ®¸ù¤ò¤Ä¤«¤àÂçµÈ¿ô" 100)
	("°Õ³°¤Ê¹¬±¿¤Ë·Ã¤Ş¤ì¤ëµÈ¿ô" 80)
	("²¦¼Ô¤ÎÉ÷³Ê¤¢¤Õ¤ì¤ëÂçµÈ¿ô" 100)
	("¶ìÇº¤ÈÈáÄË¤ÎÂç¶§¿ô" 5)
	("ÃÎÀ­¡¦´¶À­¤ËÉÙ¤àµÈ¿ô" 80)
	("ÌµËÅ¤¬ºÒ¤¤¤ò¾·¤¯¶§¿ô" 10)
	("¶ĞÊÙ¡¦¼ÂÄ¾¤ÊµÈ¿ô" 80)
	("°ì·İ¤Ë½¨¤Ç¤ëµÈ¿ô" 80)
	("±É²Ú¤ò¤­¤ï¤á¤ëÂçµÈ¿ô" 100)
	("Ëı¿´¤¬Å¨¤ò¤Ä¤¯¤ëÈ¾µÈ¿ô" 40)
	("¸­ÌÀ¤ÊÂĞ±ş¤ÇÀ®¸ù¤¹¤ëµÈ¿ô" 80)
	("ºÍÇ½¤òÀ¸¤«¤»¤Ê¤¤È¾µÈ¿ô" 40)
	("ºâ±¿¤Ë¸«Î¥¤µ¤ì¤ëÈ¾µÈ¿ô" 40)
	("¼º°Õ¤ËÂÇ¤Á¤Î¤á¤µ¤ì¤ë¶§¿ô" 10)
	("¶ìÆñ¤ò¹îÉş¤Ç¤­¤ëµÈ¿ô" 80)
	("ÌÀ°Å¤ÎÃø¤·¤¤È¾µÈ¿ô" 40)
	("Ç°´ê¤¬À®½¢¤¹¤ëµÈ¿ô" 80)
	("ºÍÃÎ¤ÈÆÁ¤òÈ÷¤¨¤¿µÈ¿ô" 80)
	("Íîº¹¤Î·ã¤·¤¤È¾µÈ¿ô" 40)
	("¹¬±¿¤¬Ä¹Â³¤­¤·¤Ê¤¤È¾µÈ¿ô" 40)
	("µÈ¶§¤ÎÇÈ´Ö¤ËÉâ¤«¤ÖÈ¾µÈ¿ô" 40)
	("É¸Åª¤ò¼Í»ß¤á¤ëÂçµÈ¿ô" 100)
	("¸«±É¤Ë¶ì¤·¤àÈ¾µÈ¿ô" 40)
	("ºÒÌñÂ³¤­¤ÎÈá»´¤ÊÂç¶§¿ô" 5)
	("¶ËÃ¼¤Ë¤Ï¤·¤ê¤ä¤¹¤¤È¾µÈ¿ô" 40)
	("¼º°Õ¤ÈÌµÎÏ¤Î¶§¿ô" 5)
	("´õË¾¤Î¸÷¤ËËş¤Á¤¿µÈ¿ô" 80)
	("¶ìÇº¤Î¸å¤Ë¹¬Ê¡¤¬ÂÔ¤ÄµÈ¿ô" 80)
	("Àº¿ÀÎÏ¤Î¼å¤µ¤ÇÇÔËÌ¤¹¤ë¶§¿ô" 10)
	("°Å°Ç¤ÎÉÔ°Â¤ËÀï¤¯¶§¿ô" 10)
	("¼«¹û¤ò¼«²ü¤·¤ÆÈ¯Å¸¤¹¤ëµÈ¿ô" 80)
	("·×²èÅİ¤ì¤Ë¤Ê¤ê¤¬¤Á¤ÊÈ¾µÈ¿ô" 40)
	("½çÄ´¤ËÈ¯Å¸¤¹¤ëÂçµÈ¿ô" 100)
	("¿êÂà¤ò¤¿¤É¤ë¶§¿ô" 10)
	("¿·ÎĞ¤Îµ±¤­¤òÊü¤ÄÂçµÈ¿ô" 100)
	("ÌîË¾¤Ä¤¤¤¨¤ë¶§¿ô" 10)
	("¹¬±¿¤ËÍá¤¹¤ëµÈ¿ô" 80)
	("ÅØÎÏ¤¬É¬¤ºÊó¤ï¤ì¤ëµÈ¿ô" 80)
	("µçË³¡¦½ÂÂÚ¤Î¶§¿ô" 10)
	("ÇËÌÇ¤Ë¸ş¤«¤¦Âç¶§¿ô" 5)
	("Ê¿ËŞ¤ÈÇ¦½¾¤ÎÈ¾µÈ¿ô" 40)
	("³Î¼Â¤µ¤Ë·ç¤±¤ëÈ¾µÈ¿ô" 40)
	("ÈÕÇ¯¤Ë±É¤¨¤ëµÈ¿ô" 80)
	("¤¦¤Ä¤í¤Ê¿ÍÀ¸¤òÁ÷¤ë¶§¿ô" 10)
	("Ê¿²ºÌµ»ö¤ÊµÈ¿ô" 80)
	("»×Î¸¿¼¤¯ÊĞ¶ş¤Ê¶§¿ô" 10)
	("ÌÀ°Å¤¬¸òºø¤¹¤ëÈ¾µÈ¿ô" 40)
	("´Ä¶­¤ËÎ®¤µ¤ì¤ëÈ¾µÈ¿ô" 40)
	("Äù¤Ş¤ê¤Î¤Ê¤¤¶§¿ô" 10)
	("Ìµ°Ù¡¦¶õÇù¤Î¶§¿ô" 10)
	("ºÇ¶Ë¡¦Éü¸µ¤ÎÂçµÈ¿ô" 100)))

(defvar Seimei-Kaku-list '(
	"¤¯¤·¤Ä¤Î¤Ø¥Î¥Õ¥Ø¥ì¤Ã¡¼°ì²µĞ¦Ğ¨Ğ­\n"
	"¤¤¤¦¤³¤Æ¤È¤Ò¤á¤ê¤í¤ó¥¢¥¤¥«¥¯¥³¥¹¥»¥½¥È¥Ê¥Ë¥Ì¥Ï¥Ò¥Ş¥à¥á¥ä¥æ¥é¥ê¥ë"
	"¥ï¥ó¤Ú¥×¥Ú¤£¤¥¥¡¥£¥ã¥å¡·¶å¼·½½¿ÍÃúÅáÆóÆşÇµÈ¬ËÎËôÎ»ÎÏĞ©ĞµÑ¹ÑÄÑÌÑÒ"
	"ÑÜÑáÒ±Ò¸Ò¹Ò¾ÒÇÒÌÒÓ\n"
	"¤¢¤¨¤«¤±¤µ¤¹¤»¤Á¤Ë¤Ì¤ß¤à¤â¤ä¤æ¤è¤é¤ë¤ì¤ï¥¦¥¨¥ª¥­¥±¥µ¥·¥¿¥Á¥Ä¥Æ¥ß"
	"¥â¥è¥í¥ò¤°¤¸¤Å¤Ù¤Ô¥Ö¥Ù¥Ñ¥Ô¤¡¤§¥¥¥§¥©¥Ã¤ã¤å¤ç¥ç¡¹²¼´³´İµ×µÚµİ¶Ò¸Ê"
	"¸ğ¸ı¹©ºµºÍ»°»³»Î»Ò¼Û½÷¾®¾å¾æ¿ÏÀ£ÀéÀîÂçÅÚÇ·Ë´ËŞËüÌ¦ÌéÍ¼Í¿Ğ¤Ğ²ÑºÑã"
	"ÓøÔéÔêÕÓÕßÕ÷ÕùÖ¥ÖßÖáÖöÖø×®×°×µ×À×Ä×Æ\n"
	"¤ª¤­¤½¤¿¤Í¤Ï¤Õ¤Ş¤ò¥Í¥Û¤´¤Ç¤É¤Ó¥¬¥°¥´¥º¥¼¥¾¥É¥Ğ¥Ó¤©°æ°ô°ú±¯±¾±ß²¦"
	"²½²Ğ²ç²ğ´¢µØµí¶§¶Ô¶è·ç·î¸¤¸µ¸¸¸Í¸Ş¸ß¸á¸ø¸û¹¦º£»Ù»ß»á¼Ü¼ê½º¾£¾¯¾é"
	"¿´¿Î¿Ñ¿åÀÚÁĞÂÀÃ°ÃæÄ¤ÄŞÅ·ÅÍÆÖÆâÆ÷ÆûÆüÇÃÈ¿ÈæÉ¤ÉÔÉ×ÉãÊ©Ê¬Ê¸ÊÒÊıË³ÌÓ"
	"ÌÚÌŞÌàÌèÌñÍ§Í½Ï»Ğ¡Ğ¢Ğ¶ĞºĞ»Ğ¼Ğ½Ğ¾ÑÂÒÀÒÁÒÆÔïÔğÕúÖ¦×·ØùÙ©Ú½Ú¾ÚÛÚÜÛ©"
	"İÆİÕİÙİãà«à­\n"
	"¤Ê¤Û¤¬¤²¤¶¤º¤¼¤Â¤Ñ¤×¥®¥²¥¶¥¸¥À¥Â¥Å¥Ç¥İ¥ô°µ°Ê±¦±¬±»±Ê±ú±û²Ã²Ä²Ó³°"
	"³î³ğ´¤´©´ÅµÖµìµîµğ¶Ì¶ç·»·ê¸¼¸Ã¸Å¸ù¹ª¹­¹°¹Ã¹æ¹şº¸ºı»¥»®»Å»Æ»Ê»Ë»Í"
	"»Ô¼¨¼¸¼º¼Ì¼ç¼ü¼ı½Á½Ğ½è¾¤¿¬¿½À¤ÀµÀ¸ÀÍÀĞÀçÀêÁÙÂ¾ÂÇÂåÂæÂüÂşÃ¡Ã¶Ä£ÄÔ"
	"ÄõÅÄÅÛÅßÆÌÆãÆôÇòÈ¾ÈÅÈÈÈéÉ¥É¬É¹ÉÕÉÛÊ¦Ê§ÊºÊ¿ÊÕÊÛÊêÊìÊñËÌËÜËöÌ¤Ì±Ì·"
	"ÌÜÌğÍ³ÍÄÍÑÎ©ÎáÎéĞ£Ğ¥Ğ§Ğ±Ğ¿ĞÀĞÁĞÂÑÅÑÆÑÇÑäÒ²ÒÂÒÃÒÈÒÉÒÚÒÛÒÜÒİÔ©ÔñÕÔ"
	"ÕàÕõÖ§ØúÛ²â¢çèíè\n"
	"¤®¤¾¤À¤Ğ¤Ö¤İ¥Ü°°°·°Â°Ë°Ğ°á°ç°ò°õ°ø±¥±§±©±ª±±±È±ø²¾²ñ²ó³¥³Æ´À´Ì´ë"
	"´ì´í´ùµ¤µÈµÉµÙµÛµàµâ¶¤¶¦¶©¶«¶Ä¶Ê·º·½·ì·ï¸à¸ò¸÷¸ş¹¡¹¥¹¾¹Í¹Ô¹çº¡º±"
	"ºÆºß»İ»à»å»ê»ú»û¼¡¼©¼ª¼«¼®¼°¼Ç¼é¼ë½£½®½¼½¿½È½Ü½ä¾¢¾±¾ç¿§¿Ô¿×À®À¾"
	"ÀåÀèÀíÁ¤Á´ÁÔÁáÁèÂ¸Â¿ÂĞÂğÂñÃ©ÃÄÃÏÃĞÃÓÃİÃçÃîÃûÄßÅÁÅÇÅôÅöÆ±ÆäÆòÆõÆù"
	"Ç¡Ç¤Ç¯È©È²ÈÁÈÆÈŞÉ´ÉúÊÆË»ËÑËèËòËøÌ¶Ì¾ÌÆÌÑÍ­ÍÓÍùÎ¾ÎóÎôÏ·Ï¾ÏÊÏËĞÃĞÄ"
	"ĞçÑÓÑÔÑÕÑÖÑŞÑåÑæÒ³ÒÄÒŞÔªÔ«ÔìÔòÕ¡Õ¢Ö¨ÖôÖõ×ÖØûØüÙªÙ«Ù¬Ù­Ù®Ú¿Û³Û´Ûµ"
	"Û¶Û·İèİéà¼æ¦æĞææçççéçêéÈë¨ìáïô\n"
	"¤Ü°¡°²°É°Ì°Ï°å°í±ş²­²´²¿²À²Ö²æ²÷²ü²ş³©³­³Ñ´£´°´Î´Ş´ô´õ´÷µ¥µ¸µ»µÑ"
	"µáµäµæµü¶¸¶É¶Ñ¶Ü¶á¶ã¶ê¶ú·¯···Á·Ï·İ·Ş·è¸«¸À¸â¸ã¹£¹§¹¨¹³¹¶¹¹¹å¹î¹ğ"
	"º¤º³º´º»ºÁºÒºàºãºäºåºî»Ç»Ö»Ú»ä»÷»ù¼µ¼Ò¼Ö¼İ¼Ş¼÷½¨½»½é½õ½ø¾²¾¶¾Ó¾ò"
	"¾ó¾õ¿­¿Ã¿Ä¿È¿É¿Ş¿á¿ùÀ¼ÀÖÀŞÁ×ÁöÂ¨Â«Â­Â¼ÂÁÂÅÂÎÂòÂôÃ¢Ã¤Ã«ÃËÄ®ÄÀÄÑÄã"
	"ÄèÄîÄïÅÆÅÎÅØÅêÆ¦ÆÅÆÓÆÙÆİÆáÇ¢Ç¥Ç¦ÇÄÇÎÇäÇìÇşÈ´È¼È½ÈĞÈİÈßÈãÈøÉªÉŞÉç"
	"Ê­Ê±Ê¼ÊÌÊÖÊãÊòË§Ë®Ë·Ë¸ËºËÉËÊË×Ì¯ÌİÌáÌêÌòÍ¤Í¸Í¾ÍÅÍŞÍàÍèÍğÍñÍøÍûÎ¤"
	"ÎÉÎâÎäÎåÏ¤Ï«Ï®Ï´Ğ¯ĞÅĞÆĞÇĞÈĞÉĞÊÑ¼ÑÈÑ×ÑçÑèÒ¢Ò£Ò´ÒºÒßÒàÒáÒâÒãÒäÒåÒæ"
	"ÒçÒèÓùÔ¬Ô­Ô®Ô¯ÔãÔóÕ£Õ¤Õ¦Õ«ÕÕÕÖÕİÕøÕûÖ©ÖªÖ«Ö¬ÖàÖâÖã×±×Ç×××Ø×Ù×ÚØ­"
	"Ù¯Ù°Ù±Ù²Ù³Ù´ÙµÙ·Ù¸ÙÆÚÀÚÁÚİÛªÛ¸Û¹ÛºÛ»Û¼Û½İçİêİëİìİíİîİïİğİñİòİóİô"
	"Ş¢à»à½à¾à¿á£áµá¶áËâ¥â¦âããçäıæ§æêæëæìçëçìçîéÉìµì¸î·ïõïöï÷\n"
	"°¤°¸°¹°¿°Í°Ñ°×°é±«±Ë±Ñ±â±ä±è±ê±ñ±÷±ı²¡²¢²¤²¥²¬²Á²Â²Ì²Ï²×²Ø²à²è²ê"
	"²ø²ı³¯³È³Ø³Ù³ı´¦´±´ß´á´ä´ñµ§µ¨µ¹µÀµÏµãµïµñµòµıµş¶¡¶¢¶¨¶±¶·¶Æ¶Õ¶â"
	"¶é¶ì¶ñ¶õ¶ş·£·µ·Â·Ô·ô¸ª¸¹¸Æ¸Ç¸È¸Ñ¸Ô¸×¸ó¸ú¹¬¹®¹´¹·¹º¹Î¹Ï¹ï¹ñ¹ú¹ıº¥"
	"ºªº«ºÊºÓºèºğºş»²»È»É»Ï»Ğ»Ş»ã»è»ö»ø¼£¼³¼Â¼Ë¼Ô¼Ù¼ã¼è¼õ¼ö¼ş½¡½Ç½Ò½ê"
	"¾ª¾°¾µ¾·¾º¾»¾¾¾Â¿â¿æ¿õÀ©À«À¬À­ÀÄÀÆÀÎÀÏÀÛÁ»ÁÀÁËÂ´Â¶ÂËÂÒÂİÂîÂóÃ³Ã´"
	"ÃÎÃèÃéÃêÃíÃ÷Ä¡Ä¹Ä¾ÄÚÄêÄìÄñÅ¡Å¥ÅªÅ³ÅµÅ¹ÅÊÅæÅìÅşÆÇÆÍÆÏÆÑÆàÆöÆıÇ°ÇÇ"
	"ÇÈÇÒÇÕÇïÇñÇ÷È¡ÈÄÈÇÈàÈäÈçÈîÈóÈúÉ½ÉÄÉÜÉİÉàÉìÉíÉîÉğÉşÊ¨ÊªÊ»ÊÂÊâÊôÊõ"
	"ÊùÊúÊüÊşË¡Ë¢Ë¼ËÃËÒËÛËåËçËíËõË÷ËùÌ£Ì¨Ì¿ÌÀÌÈÌĞÌÒÌÕÌçÌëÌïÌıÎÓÎãÎçÎê"
	"Ï§ÏÂÏÈĞªĞ³Ğ´ĞËĞÌĞÍĞÎĞÏĞĞĞÑĞÒĞÓĞÔĞÕÑ»Ñ½ÑÀÑØÑßÑéÑêÑëÒ¤Ò¥ÒËÒéÒêÒëÒì"
	"ÒíÒîÒğÒñÒòÒóÒôÒõÒöÓúÔ°Ô²Ô³Ô´ÔµÕ¥Õ§Õ¨Õ×ÕüÖ­Ö®Ö¯Ö°Ö±Ö²Ö³ÖäÖåÖæÖç×¯"
	"×¸×¹×È×É×Ê×Û×İ×Ş×à×á×â×å×æ×ç×è×é×êØıÙ¶Ù¹ÙºÙ»Ù¾ÙÀÙÂÙÃÙÄÙÅÙÇÚ­ÚŞÚß"
	"ÚàÚáÚâÛ¾Û¿ÛÀÛÁÛÂÛÃÛÄÛÅÛÆÛÇİÇİÈİÛİâİäİõİöİ÷İøİùİúİûİüİıİşŞ¡Ş£Ş¤Ş¥"
	"ßÕßÖà§à¨à®àÀàÁá¤á·áÌáÍâ³âåã«ã½ãÖãèäâæ¨æµæíæîæïçÌçÒçïçğçñçòçóçôçõ"
	"ç÷çøçùçúçûçüçıçşéÍêÎíÂíéíìî¸î¹îºïøğ°ğ²óë\n"
	"°£°¥°¨°«°º°Ä°Ò°Ù°Ú°ß°ê°ñ°ö°ù°ı±¸±Á±Ç±É±Ì±Î±Ö±å²°²·²»²Ê²Í²Ñ²ä²é²ö"
	"²ù²ú³¤³¦³§³±³À³Á³×³æ³ç³è´§´¬´¯´»´Ç´Èµªµ°µÒµÔµÕµŞµèµéµê¶®¶´¶¹¶Î¶Ş"
	"·©·³·¸·¿·À·Õ·×·ú¸¦¸©¸Â¸É¸Ì¸Î¸Ï¸Õ¸å¸ô¸ü¹¤¹«¹±¹¿¹Ä¹È¹Ó¹Ù¹á¹éº¨ººº½"
	"ºÈºÕºéºïºòºô»¢»¹»Ñ»Ó»×»Ø»Ü»ı¼¼¼í¼ó½¦½§½©½­½¶½À½Å½Ë½Ó½Õ½â½ö¾¼¾Ê¾è"
	"¾ë¾ô¿¡¿©¿®¿¯¿À¿Ó¿ãÀ§À¯À±À·ÀàÀëÀìÀôÀõÀöÀ÷ÀüÁ°ÁÄÁÕÁêÁğÁñÁ÷Â¥Â§Â¯ÂÈ"
	"ÂÑÂÔÂÕÂÛÂàÂûÃ±ÃºÃÀÃÊÃãÃëÃìÄ©Ä¼ÄÁÄÅÄÉÄÎÄÓÄâÄæÄçÄëÄûÅÀÅÙÅÜÆ¨Æ¶Æ½ÆÈ"
	"ÆÊÆîÆúÇªÇ¶ÇÉÇÖÇØÇÙÇêÇğÈªÈ¯ÈÀÈÜÈôÈûÈıÈşÉ¢É§ÉÃÉÊÉéÉëÉõÉ÷ÊÁÊÇÊÑÊØÊİ"
	"Ë¦Ë¿ËÁËÖËØËßËæËïËóÌÂÌÅÌÌÌâÌíÌóÌøÍ¦Í¨Í©Í®Í´ÍÎÍ×ÍìÎ§Î·Î¼ÎÒÎèÏºÏÄĞ·"
	"Ğ×ĞØĞÙĞÚĞÜĞİĞŞĞßĞàÑÁÑÉÑâÑìÑíÑîÑïÒ¦ÒµÒÊÒÍÒïÒ÷ÒøÒùÒúÒûÒüÒıÒşÓ¡Ó¢Ó£"
	"Ó¤Ó¥Ó¦Ó¾ÓûÓüÔ¶Ô·Ô¸Ô¹ÔºÔ»ÔôÔõÔöÔ÷Õ©ÕªÕ¬Õ­ÕØÕıÖ¢Ö´ÖµÖù×¿×Á×Ë×Ì×Î×ß"
	"×ã×ä×í×ï×ğ×ñ×ò×ô×õ×ö×÷×øÙ¨Ù¼ÙÁÙÈÙÉÙÊÙËÙÌÙÎÙÏÚÂÚÑÚãÚäÚåÚæÛ¦Û«Û¬ÛÈ"
	"ÛÉÛÊÛËÛÌÛÍÛÎÛÏÛĞÛÑÛÒÛÓÛÔÛÕÛÖÛ×İÉİÊŞ¦Ş§Ş¨Ş©ŞªŞ«Ş¬Ş­Ş®Ş¯Ş°ß×ßÙßÚßÛ"
	"ßÜà©à¬à²àÂàÃàÄàİàŞàßàààáá¥á¦á§á¨á¸á¹áºá¼áÎáÏâ£â§â½â¾â¿âÀâââæâçã»"
	"ã¼ã¾ã×ãéãêãóäşå¡åıæ©æğæñæòæóæôæõæöæ÷çÍè¡è¢è£è¤è¥è¦è§è¨è©èªè«è¬è­"
	"èÏêÒêÓêÕêÖë¾íêíëííîÄïÙïùïúïûğêğìòë\n"
	"°¢°§°©°Æ°÷±¡±¨±´±º±×±Ù±ã²§²®²¶²¸²Æ²È²Ù²Ú²ã²å³¢³²³½³Ê³Ë³ô³ø³ü´¼´Ğ"
	"´Ù´ûµ¢µ­µ¯µ²µ´µËµÎµÜµó¶ª¶²¶³¶»¶¼¶Í¶æ¶ë¶ı·ª·¬·±·´·¾·Ã·Ë·å·ğ·ó·õ·ı"
	"¸®¸¶¸Ä¸Ë¸ä¸ç¸õ¸ö¹¸¹»¹À¹É¹Ì¹Ò¹×¹Ü¹ß¹â¹ä¹üº¬º¶º¹ºÂºÃºËºÏºÖºŞºâºóºõ"
	"º÷ºù»¦»«»¯»·»½»Ä»Õ»æ»é»ş¼À¼Æ¼Í¼Ó¼Ú¼à¼å¼ì¼î¼ò½¤½¾½Ô½Ú½Ş½ã½ñ½ù½ú½ü"
	"¾¥¾¬¾­¾Ã¾É¾Í¾Î¾Ğ¿«¿°¿±¿¶¿¸¿»¿¾¿¿¿Á¿Ë¿Ö¿Ø¿à¿è¿êÀ¦À¨À´ÀÂÀÈÀÉÀÊÀÔÀğ"
	"ÀòÀóÁ®ÁÅÁÇÁÒÁÜÁŞÂ¤Â©ÂªÂ®ÂµÂ¹ÂÓÂÙÂïÂ÷Ã¬Ã¿ÃÍÃÑÃ×ÃÜÃàÃáÃïÃñÃüÄ¿ÄÌÄí"
	"ÄğÄòÄşÅ£Å¯Å¸ÅÌÅÓÅÖÅ×ÅİÅŞÅàÅâÅåÅçÅíÅóÆ¤Æ©Æ¹Æ¿ÆÂÆÃÇºÇ¼Ç½ÇÂÇËÇÏÇĞÇÛ"
	"ÇÜÇßÇâÇçÇéÇíÇüÈ«È»ÈÉÈÊÈÌÈÛÈèÈëÈïÉ°É±É³É¶É¿ÉÂÉÍÉÒÉâÊ´Ê¶ÊÅÊÙÊàÊáÊï"
	"ÊğÊöÊ÷ÊûË¤Ë¶ËÂËäËéËñÌ®Ì°Ì²Ì¼Ì½Ì×ÌæÍ°ÍÆÍáÍéÎ®Î±ÎµÎ¹Î¿ÎÁÎÑÎŞÎõÎøÏ¢"
	"Ï¯Ï²ÏµÏÁÏÆĞ«Ğ¸ĞÛĞáĞâĞãĞäĞåĞæĞèĞéĞêĞëĞìĞíĞîĞïÑÊÑÍÑÎÑÏÑÙÑÚÑğÑñÒ§Ò×"
	"Ó§Ó¨Ó©ÓªÓ«Ó¬Ó­Ó®Ó¯ÓºÓıÔ±Ô¼Ô½Ô¾Ô¿ÔÀÔÂÔøÔùÕ®Õ¯Õ°Õ±Õ²Õ³ÕáÕâÕñÕşÖ¡Ö¶"
	"Ö·Ö¸Ö¹Ö»Ö¼×²×Í×ë×ì×î×ó×ù×ú×û×ı×şØ¡Ø¢Ø£Ø¥Ø¦Ø§Ù½ÙÍÙĞÙÑÙÒÙÔÙàÚÃÚÓÚÔ"
	"ÚÕÚÖÚçÚèÚéÚêÚğÛÙÛÚÛÛÛÜÛİÛŞÛßÛáÛâÛãİÖİåİæŞ±Ş²Ş³Ş´ŞµŞ¶Ş·Ş¸ŞºßİßŞßß"
	"ßààÅàÆàâàãàäàşá»á½áĞáÑáÒáÓáÔáÕáÖá×â¨â®â´âÁâÂâÃâÄâÅâÆâéã¬ã­ã®ã¯ã°"
	"ã±ã¿ãÀãÁãÂãØãëãìãíãôãõãöä¢ä¤äãääå¢å£å¤åşæªæ«æ¶æÂæÃæÍæÎæÑæÒæÖæ×æø"
	"æùç¦çÓçÕçÖçäçíçöè®è¯è°è±è²è³è´èµè¶è·è¸è¹èºè»è¼è½è¾éÊéÎéÏéĞéÑéÒéÓ"
	"êÈêÉêÏêĞê×êØêÙêÚêÛêÜë¿ëÀëÁì±ì¹ìâí»íïíğíñíòíşî»î¼î¾îÛîÜîİîŞïıïşğ¡"
	"ğ¢ğ£ñõò¨ò®ò¯\n"
	"°­°´°Á°Ã°Ó°Ô°Û°Ü°à°è°ï°ü±¢±Õ±æ±ë²«²³²Û²ß³£³³³¶³Â³Ì³Ô³İ³Ş³á³å³é³ë"
	"³ñ³õ´¥´ª´µ´Ó´ã´ğ´óµ¬µµµ¶µÅµÆµÓµßµåµõµöµû¶¯¶µ¶¿¶İ¶í¶ö¶ü·¡·¶·¼·Ç·Ì"
	"·Í·Ğ·Ö·í·ñ·ò¸£¸±¸½¸¾¸¿¸Ó¸è¹¯¹µ¹¼¹õ¹ûº¢º§º­º®º¯º°ºÌºÎºÑº×ºØºÙºÚºê"
	"ºëºûºü»©»´»º»Â»ç»ë¼¦¼¯¼¶¼¹¼½¼Å¼Î¼Ï¼Ğ¼Ø¼á¼ä¼ø½ª½¬½µ½Â½É½Ê½Í½Ñ½ß½í"
	"½î¾¦¾§¾«¾¹¾¿¾Ä¾Ï¾Ò¾Ô¾Ù¾ê¾ï¾ğ¾ı¿¼¿Â¿Ê¿Ú¿ä¿ì¿ò¿ø¿û¿ıÀ¶À¹ÀËÀÌÀÕÀÜÀß"
	"ÀãÀûÁ¥Á¼Á¾ÁÆÁÈÁÖÁİÁßÁâÁãÁëÂ¦Â²ÂÃÂÉÂÏÂŞÂáÂèÂöÃ¦ÃµÃ¸ÃÁÃÇÃâÃöÃøÄ¢Ä¥"
	"Ä¦Ä¯ÄºÄ»Ä½ÄÄÄÏÄÛÄİÄàÄäÄåÄôÅ«ÅºÅ¼Å¾ÅÈÅËÅÑÅÔÅéÅîÅğÅñÅøÆ«Æ°Æ²ÆºÆÀÆÒ"
	"Æ×ÆÚÆèÆğÇ­Ç±Ç´Ç¸Ç¾ÇÌÇÓÇÔÇİÇæÇôÇõÈÎÈÔÉ©É­É·É¼ÉÁÉËÉÏÉÓÉÖÉØÉÚÉäÉôÉû"
	"ÊÄÊĞÊÚÊîÊøË£Ë¨Ë¬Ë¾ËÕËÙËãÌ©Ì³ÌÔÌäÌîÌõÍ£ÍªÍ¹ÍÇÍßÍâÍäÍüÍıÎ¦Î¨Î«Î¬Î°"
	"Î³Î´ÎÂÎÃÎÄÎÍÎÔÎßÏ¬ĞğĞñĞóĞôĞõĞöĞ÷ĞøĞùÑİÑàÑòÑõÑûÒ¨Ò¶Ò·Ò¿ÒÎÒÔÒØÓ°Ó±"
	"Ó³Ó´ÓµÓ¶Ó·Ó¸Ó¹Ó»ÓşÔ¡Ô¢ÔÁÔÃÔÄÔíÕ´ÕµÕ¶Õ·Õ¸Õ¹ÕºÕÙÕãÕäÕåÕòÕóÖ½Ö¾ÖÀÖÁ"
	"ÖÂÖÃÖÄÖÅÖÆÖÇÖèÖé×º×Â×Ï×Ğ×Ñ×Ò×üØ¤Ø©Ø«Ø¬Ø®Ø¯Ø°Ø±ØşÙÕÙÖÙ×ÙØÙÙÙÛÙÜÙİ"
	"ÙŞÙßÚÄÚÅÚÆÚÇÚÏÚ×ÚëÚìÚíÚîÚïÚñÛ­ÛàÛäÛåÛæÛçÛèÛéÛêÛëÛìÛîÛïÛğÛñÛòÛôÛõ"
	"İ·İ¸İËİÜİİŞ»Ş¼Ş½Ş¾Ş¿ŞÀŞÁŞÂŞÃŞÄŞÅŞÆŞÇŞÈŞÉŞÊŞËŞÌŞÍŞÎŞÑßØßáßâà³àµàÇ"
	"àÈàÉàÊàËàÌàæàéá¡á©áªá¾á¿áÀáØáÙáÚâ©âµâ¶âÇâÈâëãÚãîã÷ãøãùãúãûãüãıå¥"
	"å¦å§å¨å©åªå«æ·æ¸æ¹æÄæÓæØæÙæúæûæüæıçÎç×çØè¿èÀèÁèÂèÃèÄèÅèÆèÇèÈèÉèÊ"
	"èËèÌèÍèÎèÒéÔéÕéÖé×éØéÙéÛêÊêÑêÔêİêŞêßêàêáêâë¬ëÂëÃëÄì®ìÁìÃìÄìÅìÉìå"
	"ìæìçíÃíÄíóíôíõíöí÷íøíùíúî¥î½îÅîÆîßîàîáîåïÚïÛïüğ¤ğ¥ğÕğïñÄóÃóÎóĞ\n"
	"°ª°®°¯°¼°À°Î°Ø°û±²±¹±¼±¿±À±Ä±Í±Ó±Û±á±ç±ù±ü²¹²á²ì³¨³«³¬³®³¹³¿³Ã³Ğ"
	"³ä³ş´¡´¨´­´®´¹´º´½´¾´Ö´×´ç´î´ö´ø´ü´ıµ©µ®µ½µÊµĞµëµôµ÷¶¬¶Ç¶Ë¶Ï¶Ğ¶Ö"
	"¶×¶Ú¶ô¶÷¶ø¶ù·¨·É·Ê·Ú·á·ë·ö·÷·ø·ş¸¡¸§¸º¸Ğ¸Ö¸Û¸æ¹¢¹²¹Á¹Å¹Ê¹Ğ¹àº¾ºÇ"
	"ºÔºÛºæºö»±»¶»Û»ì»õ¼¢¼´¼¾¼È¼Ñ¼æ½¢½°½¸½×½Û½ç½ë¾¡¾¸¾½¾Å¾Æ¾Ç¾Ë¾Ñ¾Ú¾Û"
	"¾İ¾ì¾ö¿¢¿£¿¹¿Ç¿Ò¿Ù¿Ü¿İ¿ß¿ë¿ï¿úÀ²À³ÀÇÀäÁ±Á³Á½ÁÁÁÂÁÊÁÏÁÓÁÚÁéÁòÁõÂ¬"
	"Â°Â·ÂºÂ½ÂÂÂÄÂÆÂØÂßÂâÃ£Ã§ÃªÃ¹Ã»ÃÆÃÒÃÙÃŞÃåÃğÃùÃıÄ«Ä±Ä¶ÄÇÄËÄÍÄéÄóÄø"
	"Å½ÅÏÅĞÅãÅëÅïÅòÅ÷ÅùÅúÅûÅıÆ¡Æ¸Æ»ÆØÆÛÆßÇ£Ç¬ÇÁÇÊÇÑÇŞÇãÇëÇîÈ£È¦È®ÈµÈº"
	"ÈÃÈÓÈÕÈÖÈÚÈáÈâÈåÈñÈ÷ÈüÉ«É®É¯É²É¾ÉÈÉÌÉÙÉáÉòÉøÉüÉıÊ¥Ê²Ê·Ê½Ê×ÊäÊçÊó"
	"ËµË¹ËÀËÇËşÌ«ÌµÌºÌ»ÌÉÌãÌåÌûÍ¬Í¯Í±ÍµÍ·ÍºÍÈÍÉÍÕÍÚÍÛÍíÍîÍòÎ¡Î£ÎªÎ²ÎÌ"
	"ÎÖÎİÎöÎûÏ­Ï½ÏÇÏĞÏÑÏÓĞ°ĞúĞûĞüÑËÑóÑôÒ©ÒÅÒÏÒĞÓ²Ó¼Ó½Ó¿ÓÀÓÁÓÂÓÃÓÄÓÅÓÆ"
	"ÓÇÓÈÓÉÓÊÔ£ÔÅÔÆÔÈÔÎÔäÔåÔæÔúÔûÕ»ÕÚÕæÕçÖ£Ö¿ÖÈÖÉÖÊÖËÖêÖëÖìÖóÖúÖû×¶×Å"
	"×Ó×ÜØ¨ØªØ³ØµØ·Ø¸Ø¹ØºØ»Ø¼Ø½Ø¿Ù¡ÙÚÙáÙâÙãÙäÙåÙæÙçÙèÙéÚÈÚÉÚòÚóÚõÛ®Ûó"
	"ÛöÛ÷ÛøÛùÛúÛûÛüÛıÛşÜ¡Ü¢Ü£Ü¥Ü¦Ü§Ü¨Ü©ÜªÜ«Ü¬Ü­Ü®Ü¯Ü°Ü±Ü²İ¹İºİÌİÍİ×İŞ"
	"İßŞÏŞĞŞÒŞÓŞÔŞÕŞÖŞ×ŞØŞÙŞÚŞÛŞÜŞİŞŞŞßŞáŞâŞãßãßäàªà°à´à¶àÍàÎàÏàĞàèàê"
	"àëá´áÁáÂáÇáÛáÜáİâ¤âªâ«â¯âÉâíã²ãÃãÄãÙãÛãÜãïãğãşä£ä¥ä¦ä­ä¸äåäæäçäè"
	"äéäêå¬å­å®å¯å°å±å²å³æÅæÆæÏæÚæşç¡ç¢ç£ç¤ç¥èĞèÓèÔèÕè×èØèÙèÛèÜèİèŞèß"
	"èàèáèâèäéÜéİéŞéßéàéáéâêåë©ë­ë¸ë¹ëºëÅëÆëÇëÈëÉëÊìºìÆìÈìÊìÌìßìãìèìé"
	"ìêìëìììíí¼íÅíÆíÇíãíûíüíıî¿îÇîÈîØîâîãîäîæîçïÏïÜïİğ¦ğÖğ×ñ¤ñÇñÈóãô¡\n"
	"°¦°±°»°Å°Õ°ã°î±°±à±ì±î±ó±ô±ö²Ç²Ë²Ò²Ş²ë²í²ò²ô³´³·³¸³º³Ó³Ö³Ú³ê³ì³÷"
	"´«´²´´´¶´Á´è´şµÁµÍ¶È¶Ø¶Ù¶ò¶ó·¢·¤·²·¹·È·Ñ·Ó·Ø·ä·æ·ù¸¥¸¨¸¯¸»¸Ø¸Ù¸Ú"
	"¸İ¸ê¸ë¹Â¹Û¹øº·ºÀºÄºÅºÉºĞºÜºáºçºìºñ»Ì»â»í»î»ñ»ó»ô»ü¼¬¼­¼»¼ğ½¥½¯½·"
	"½Ø½İ½à½ğ½ı¾©¾È¾Õ¾Ü¾à¾ø¾ş¿¨¿²¿µ¿·¿Õ¿ç¿ğ¿ó¿ô¿şÀªÀ»À¿À×ÀİÀáÀïÀùÁ¢Á£"
	"Á§Á¨Á©ÁµÁºÁ¿ÁÌÁÍÁÎÁÛÁóÂ±Â³Â»ÂÊÂÚÂÜÂìÂıÃ²ÃÈÃÔÃÕÃÖÃÚÃßÄ­Ä²Ä·ÄÂÄÈÄØ"
	"ÄöÄ÷ÄúÅ¤Å®Å´Å¶ÅÂÅÅÅÉÅäÆ¯ÆÄÆÎÆÜÆêÆëÆíÆïÇÀÇ×ÇàÇáÇùÈ­È·È¹ÈÂÈÑÈÒÈùÉÇ"
	"ÉöÊ¡Ê¢ÊèË©ËªË­Ë°ËÓËÚËëÌ¬Ì­Ì´ÌÁÌÇÌÎÌØÌìÌ÷ÌüÍ²ÍÀÍÂÍÃÍÌÍÏÍÖÍçÍëÍïÎ¢"
	"Î¯ÎºÎÇÎëÎíÎ÷ÎúÏ¡Ï¨Ï©Ï°Ï±ÏÃÏÅÏÍÏÒĞ¬Ğ¹ĞòĞıĞşÑ¡Ñ£Ñ¤ÑöÑ÷ÒªÒ«Ò¬Ò­Ò»ÓË"
	"ÓÌÓÍÓÎÓÏÓĞÓÑÔ¤Ô§ÔÉÔÊÔËÔÌÔÍÔçÔüÕ¼Õ½Õ¾Õ¿ÕÀÕËÕÌÕëÕöÖÌÖÍÖÎÖíÖü×»×Ã×Ô"
	"Ø²Ø´Ø¶Ø¾ØÁØÃØÄØÆØÈØÉØËÙ¢ÙÓÙêÙìÙíÙîÙïÙñÙòÙóÚĞÚØÚôÚöÚ÷ÚøÜ¤Ü³Ü´ÜµÜ¶"
	"Ü·Ü¸Ü¹ÜºÜ»Ü¼Ü½Ü¾Ü¿ÜÀÜÁÜÂÜÃÜÄİ»İ¼İ½İÚŞäŞåŞæŞçŞèŞéŞêŞëŞìŞíŞïŞğŞñŞò"
	"ßåßèßéßêßëßìàÑàÓàìàíàîàïàğàñàöá³áÃáÄáŞáßáàáááâáãáäáåâ¬â·âÊâËâÌâÍ"
	"âÎâäâìâîâïâğâñã³ãÅãÆãÇãÈãÉä¡ä§ä¨ä©äªä«ä¬ä®äëäìäíäîäñå´åµå¶å·å¸å¹"
	"åÆæ¬æ­æ®æºæÔæÛæçæèæéç§ç¨ç©çªç«çµçÏçÙèÚèãèåèæèçèèèéèêèëèìèíèîèïèğ"
	"éËéãéäéåéæéçéèéééêéëéìéíêËêãêäêæêèêéêëêìêíë»ëËëÌëÍëÎëÏëĞëÑì¶ì»ì¼"
	"ì½ìÇìËìÜìîìïìğìñí¾íÈíÉíÊíÒíäî¡î¢î£î¤î¦î§î¨îÀîÉîèîéîêîëîìîíîïîğîñ"
	"îöïŞïßïàğ§ğ¨ğ©ğ³ğ´ğµğ¶ğ»ğØğñğòğóñ«ñ¬ñìñöòêòìòïóÆóæ\n"
	"°¶°½°İ°ğ°ş±£±³±¶±Â±Ø±İ±Ş±é²Å²É²Î²Õ³¡³µ³Ä³Ç³Ò³Õ³ò³ó´·´Ã´É´Ø´úµ¿µù"
	"¶£¶­¶ä¶î·¦·§·Û¸ì¸í¹½¹Ë¹Ñ¹Ú¹Ş¹ë¹ò¹ó¹ö¹÷º²º¼ºİ»¡»¨»»»À»ï¼¤¼§¼¿¼Ã¼×"
	"¼ï¼ú¼û½Æ½Î½ï¾¨¾´¾Ø¾ã¿ª¿º¿Ğ¿é¿üÀ¢ÀºÀ½ÀÀÀÅÀÙÀâÀúÁ¬Á­Á²Á¹ÁØÁäÁæÁíÁî"
	"ÁïÁøÁüÁıÁşÂÌÂÖÃ¥Ã¨Ã·Ã¼Ã¾ÃØÃäÄ§ÄªÄ¸ÄÒÄÕÄÖÅ¦Å©Å¬ÅèÆ¼ÆÁÆÉÆĞÆøÇ§Ç«Çó"
	"ÇıÈ¤È¥È±È³È¶ÈêÈìÈõÉ¡É£ÉºÉåÊ£Ê¹ÊËÊÎÊÏÊåÊéÊëË±ËÆËÈËÍËÏËêËìËıÌ¡Ì¢Ì§"
	"ÌªÌÃÌÄÌÊÌÏÌÖÌßÍ¶ÍÍÍĞÍÙÍşÎ½ÎÎÎĞÎÜÎñÎòÎıÏ³Ï¹Ñ¢Ñ¥Ñ¦Ñ§Ñ¨Ñ©ÑªÑ¾ÑĞÒ¼ÒÑ"
	"ÒÒÓÒÓÓÓÔÓÕÓÖÓ×ÓØÔ¥Ô¦ÔÇÔÏÔĞÔèÔëÔîÔıÔşÕÁÕÂÕÃÕÄÕÅÕÛÕèÕéÕêÕìÕôÖºÖÏÖĞ"
	"ÖÑÖîÖïÖ÷ÖıÖş×¡ØÀØÂØÅØÇØÊØÍØÎØĞØÒØÓØÔØÕØÖØ×ØØØÙÙ£ÙëÙôÙöÙ÷ÚÊÚùÛ¡ÜÅ"
	"ÜÆÜÇÜÈÜÉÜÊÜËÜÌÜÍÜÎÜÏÜĞÜÑÜÒÜÓÜÔÜÕÜÖÜ×ÜØÜÙÜãİ¾İÎŞàŞôŞöŞ÷ŞøŞúŞûŞüŞı"
	"Şşß¡ß¢ß£ßæßçßíßïßğà·à¸àÒàçàóàôàõá«á¬á­áæáçáèâ°â±â¸âÏâĞâÑâòâóâôâõ"
	"ã´ãÊãİãñãòä¯ä°ä±ä²ä³ä´äµä¶ä·ä¹äïäğåºå»å¼å½å¾å¿åÀåÂåÃåÅåÇåîæÇæÜæİ"
	"æŞç¬ç­ç®ç¯ç°çÉçÊçĞèÑèñèòèóèôèõè÷èøèùèúéîéïéğéñéòéóéôêçêêêîêïêğêü"
	"ë®ëÒëÓëÔëÕëÖë×ëØì¾ìäìòìóìôìõíËíÌíåî©îªîÁîÊîËîîîòîóîôîõîúïáïâğÒğÙ"
	"ğÚğÛğÜğİğğñ¥ñ¦ñÉñíñ÷ñøóéóîô¢ô£ô¤\n"
	"°È°Ö°ä±½±Æ±Ô±Ú±Ü±ï²£²ª²¯²Ô²Ü²İ²î²ï³É³Î³ã³ú´¿´Â´Æ´Ë´Ò´å´ï´òµ£µ¦µ±"
	"µ·µºµÃµç¶¾¶Û¶ï¶ğ·®·Ä·Å·Î·à·â·é¸¢¸Ò¹Æ¹í»£»µ»¿»Ã»ò¼Á¼É¼ñ½Ï½á½å½æ½ô"
	"½û¾³¾À¾Ö¾×¾Ş¾ü¿³¿Ì¿ÛÀ¡ÀÁÀæÀñÀøÀıÀşÁªÁ«Á¸ÁåÂ¢ÂúÃ¯Ã½ÃÂÃÌÃòÃóÃôÄ¬Ä³"
	"Ä´ÄÆÄĞÄÙÄùÅ¢Å¨Å°Å±ÅÒÆ¢Æ§Æ³Æ´ÆµÆ¾ÆìÇ®Ç²ÇÅÇÍÇÚÇåÇèÈ¢È¨ÈÏÈ×ÈØÈÙÈíÈğ"
	"É¦É¨É¸É»ÉÀÉÆÉĞÉßÉæÉêÉïÉñÉóÊ®Ê¯Ê°Ê¾ÊÀÊÃÊÈÊÓÊÔÊŞÊßÊæË«Ë¯Ë½ËËËĞËàÌ¥"
	"ÌËÌÛÍ«ÍÒÍÜÍİÍúÎ­Î¸ÎÀÎÊÎËÎØÎîÎùÏ¥ÏÀÏÏÑ«Ñ¬Ñ­Ñ®Ñ¯Ñ³ÑÑÑÛÑøÑüÒ½ÓÙÓÚÓÜ"
	"ÓİÓŞÓßÓâÔÑÔÒÔÓÔ×ÔØÕÆÕÇÕÈÕÉÕíÖÒÖÓÖ×ÖğÖñÖò×¢×£×¤×¥×¦×§×¼ØÌØÏØÑØÜØİ"
	"ØŞØßØâØãÙ¤ÙõÙùÙúÙûÙüÙıÚËÜÚÜÛÜÜÜİÜßÜàÜáÜâÜäÜåÜæÜçÜèÜéÜëÜìÜîÜøİ¿İÏ"
	"İØİàŞîŞóŞùß¤ß¥ß¦ß§ß©ßªß¬ß­ß®ß¯ß°ß±ß³ß¹ßÌßñßòàÕàòà÷àøá°áéáêáëáìáí"
	"áîâ­â²âÒâÓâÔâöâ÷âøâùâúâûâüâıãµãËãÌãÍãÎãßäºä»ä¼ä½ä¾ä¿äòäóåÄåÈåÉåÊ"
	"åËåÍåÎåÏæ¯æ»æ¾æÈæÉæßç±ç²ç³ç´ç¶ç¹çÔèÖèöèûèüèıèşé¡é£é¤éõéöé÷éøéùéú"
	"éûéüéıéşê¡ê¢ê£ê½êòêóêôêõëÙëÚëÛëÜì²ì¿ìÍìÎìÏìöì÷ìøìùí©íÍíÎíÏíĞíÑíÓ"
	"î«î¬îÂîÃîÌîÍîÎî÷îøîùï¥ï¦ïãğ¼ğ½ğÑğŞğßğàğõğöñ­ñ®ñÊñËñÌñÍñÎñùñúñûñü"
	"ñıò©ò°ò±ò·òíòîòğòñóÏóÑóÕóï\n"
	"°¬°¾°Ş°â±®±Ã±Ï±Ğ±Ò±í±ò±õ²©²±²º²õ²û³¼³Í³ß³û´¸´Í´Ô´Û´Üµ¡µ«µÌµøµú¶°"
	"¶¶¶½¶Å¶Ó·°·Æ·ã·û¸­¸Á¸ï¹Õ¹İ¹ùº¦ºø»¬»Á»ğ¼²¼Ê¼â¼ô¼ù½´½Ã½Ä½ò¾Á¾ä¾í¾î"
	"¾û¿Å¿Æ¿í¿îÀ°ÀÃÀÑÁ¦Á·ÁàÂãÂéÂùÃ®ÃÅÃÛÄµÄüÄıÅÃÅõÅüÆ¬ÆÆÆËÆÕÆŞÆåÆæÇ³Ç»"
	"ÇöÇûÈ°È¸ÈËÈòÉÅÉùÊ«Ê³ÊÉË¥ËÄËÅËÔËáÌÍÌôÌùÍ¡Í¢Í»ÍÊÍØÍêÎ¶ÎÕÎÙÎìÏ£Ï¶Ï¿"
	"Ğ®ĞÖÑ±Ñ²ÑÃÑùÑúÑıÑşÒ¡Ò®Ò¯ÓàÓáÓãÓäÓåÔ¨ÔÔÔÖÔÙÕÊÕÜÕîÖÔÖÕ×¨×©×´×ÕØÚØÛ"
	"ØàØáØäØåØèØêØëØíØîÙ¥Ù¿ÙşÚ¡Ú¢Ú£Ú¤Ú¥Ú§ÚÚÚúÚûÚüÚıÚşÛ¢ÜíÜïÜğÜñÜòÜóÜô"
	"ÜõÜöÜ÷İÀİÁİĞİÑß²ß´ßµß¶ß·ß¸ßºßÂßóßôßõßöß÷ßøßùàÔàÖà×àåàùá®á¯áÊáïáğ"
	"áñâ¹âºâÕâÖâşã¡ã¢ãàäÀäÁäÂäÄäÅäÊäôäõä÷åÌåĞåÑåÒåÓåÕåÖå×åØæ¼æÕç·ç¸çÅ"
	"çËçÚçÛé¥é¦é§é¨é©éªé«é¬é­é¯é°é±é²é³ê¥ê¦ê§ê±ê²êÌêöêùêúë¯ë°ëİëŞëßëà"
	"ëáëâëãëäëåëæëçëëì³ì·ìàìúìûìüìıí¿íÔíÕíÖî­î®î¯î²îûîüîıîşï¡ï¢ï£ï¤ï§"
	"ïäïåïæïçğªğ«ğ¹ğºğ¾ğ¿ğÀğÁğÂğÃğÄğĞğÓğôğ÷ğøñ¯ñ°ñ±ñ³ñÏñĞñÑñÒñØñîñşò¡"
	"òªò¸ò¹òºò»ò¼òòòóòõòöòøòùóÇóÒóØóı\n"
	"°Ç°ë±Å²¨²²²â³Å³à³í³ö´Ä´Ú´âµ¼µ¾µÇ¶º¶à¶û·­·Ò¸¬¸°¸·¸é¹Ç¹Ö¹Ø¹ã¹è¹êº©"
	"ºú»¤»§»­»¸¼Ä¼Õ¼ß½«½¹½Ì½Ù½ì½ş¾Ì¾ß¾á¿¤¿öÀÓÁ¡Á¯ÁçÁìÁúÂ×ÂõÃÃÃÉÄ°ÄÊÄ×"
	"ÄÜÅ§ÅÕÆ¥Æ·ÆÔÆéÇ¨Ç¿ÉÑÊµÊÍËîÌÙÍ¥ÍÁÍãÍæÍ÷ÎÅÎÆÎæÎğÎşÏÎÑ°Ñ´ÒÕÒÙÓÛÓæÓç"
	"ÓêÔÚÔÛÔÜÕÍÕÎÕŞÖÖÖØÖÙ×½ØæØéØìØïÙ¦Ú¦Ú¨Ú©ÚªÚ«Ú¬Ú®Ú¯ÚÌÛ£Û¤Û¯ÛØÜùÜúÜû"
	"ÜüÜıÜşİ¡İ¨İ¬İÂİáŞ¹ß¨ß»ß¼ß½ß¾ß¿ßÀßÁßúßûßüßıà¯àºàØáòáóáôáöâ»â×âØã£"
	"ã¤ã¶ã·ã¸ãÏãĞããäÃäÇäÈäÉäËäÌäÍäÎäöåÁåÔåÙåÛåÜåİåŞåßåàåáæ¡æÊæàæáæâçº"
	"ç»ç¼ç½ç¾ç¿çÀçÑçÜçİçåé´éµé¶é·é¸éÌê¨ê©êªê«ê¬ê­ê®ê¯ê°ê³ê¼êñê÷êøêûë±"
	"ë²ëèëéëêëìëíëîëïëõëöì¯ì°ìÀìÂìĞìÑìÒìşí¡í¢í£í¤í¥í«í×íØíÙî°î±î³îµîÏ"
	"ï¨ï©ïªï«ï¬ïèïéïêïëïìğ¬ğ­ğ®ğ±ğ·ğáğùñ§ñ²ñ´ñµñ¶ñÅñÓñÔñÕò½ò¾ò¿òÀò÷òú"
	"òûòüòıòşóÈóÖóÙóÚóÛóäóíóğóş\n"
	"±­³»³Ï³Û³Ü³ù´Ê´Ñ´éµ³¶ß¸²¸³¸ñ¹ôº¿½Ö½ó¾ñ¾÷¿¥¿¦¿÷ÀØÁ¶ÁÃÁÑÁùÁûÂ£ÂêÃõ"
	"Ä¨ÄÃÆ£Æ®ÆñÇ©Ç¹ÈÍÉµÊ¤ÊÊÊÜËİËúËûÌşÍËÍôÍõÎÈÎ×ÎàÒÖÓèÓéÔİÔŞ×³ØğØóÙ§Ú±"
	"Ú²Ú³Ú´Ú¶Ú¹ÚÍÚÒÚÙÛíÜêİ¤İ¥İ¦İ§İÃİÅİÒßÃßÄßÅßÆßÇßÈßÉßîßşà¡à¢àÚàúàûá±"
	"á²áõâÙâÚâÛâÜâİâŞã¥ã¦ã§ã¹ãÑãÒãáãâãääÏäĞäÑäÒåÚåâåãåäåååæåçæ°æ²æËæã"
	"çÁçÂçŞé®é¹éºé»é¼ê´êµê¶êıë³ë¼ëğëñëòëóëôì´ìÓìÔí¦í§í¨íªíÚíÛíÜíîîĞîÒ"
	"îÚï­ï®ï¯ï°ï±ïíïîïïğ¸ğÅğâğãğäğúğûñ·ñ¸ñÆñÖñ×ñïò¢ò«ò²ò³ò´òÁòÂòÃòÄòÅ"
	"òÆòÇó¡ó¢ó£ó¤ó¥ó¦óÉóÜóêóì\n"
	"°³±¤±ğ³ª´æ´êµÂ¶À·«·Ù·Ü·ß¸´»ª¼¥¼±½³¿ñÀ¥ÁÉÁôÂ¡ÂÍÂäÂíÃşÅ­Å²Å¿ÇÆÇøÇú"
	"ÈöÉèÊíË²Ì¸Ì¹ÍåÍöÎ¥ÎïÎüÏ¦Ï¼Ò°ÓëÓìÔÕÔàÔâÕÏÕğ×ªØçØñÚµÛ¥İ£İ©İªİ«İ­İÔ"
	"ß«ßÊßËßÍßÎßÏà£à±à¹àÙàÜá¢áÅáÆá÷âêã¨ãÓäÓäÔäÕäÚåèåéåêæ±æ½æ¿æÀçÄçßçà"
	"çáé¢é½é¾é¿éÀéÁéÂéÃéÄê¤ê·ê¸ê¹êºê»ê¿êşë¡ë¤ëªë÷ëøëùëúëûëüëıìÕìÖí¬í­"
	"í®í°íÀíİíæî´îÑï²ï´ïµï¶ï·ï¸ï¹ïºï»ïğğ¯ğÆğåğæğëğîñ¹ñºñ»ñÙòÈòÉòÊòËòÌ"
	"òÎòÏòĞó§ó¨ó©ó«ó¬óÊóËóÌóÓóå\n"
	"³¾³â´àµÄ¶¥¶Á¶Â·ü¸î»¼¾â¾ù¾úÀÒÆªÆ­È§ÉÎÍÔÍóÏÌÓíÓîÔßÔáÕĞÕÑÕÒÕï×­ØòØõ"
	"Ú·Û§Û°İ¢İ®İ±ŞõßĞßÑßÒà¤àÛàüáøâ¼âßâèã©ãªãåäÖäÙäùäúåëåìåíåïåğæ¢æÁæä"
	"çÃçÆéÅéÆê¾êÀë¢ë£ë´ë½ëşì¡ì¢ì£ì×ìØí¯í±í²í½íŞîÓîÔîÙï³ï¼ï½ï¾ï¿ïÀïÁïÅ"
	"ïñğÇñ¨ñ©ñ¼ñ½ñÚñÛñŞò¬òÑòÒòÓòÔòÕòÖò×òØòÙòÚòÜóªó­ó®ó¯óÄóİóŞóñóòóóóô\n"
	"°ó´Ï¸Ü¹ìÂøÄáÅ»ÆçÉÉËâÌöÌúÏªÑµÑ¶ÓïÓğÓñÓòÓóÓôÖ¤ÖÚÖÛ×«ØöØ÷ÙğÚ¸Û¨Û±ÜŞ"
	"İ¯İ°İ²İÄİÓà¥àıáùáúáûáüãÔãŞä×äØäÛäßåñåòåóåôåöåúæ£æÌçÇçâéÚêÁêÂë¥ì¤"
	"ì¥ìÙìÚìİí³í´íßíçîÕïÂïÃïÄïÆïÇïòïóğÈñªñ¾ñ¿ñÀñÁñÂñÜñİñßñàñğò£òµòÛòİ"
	"òŞòßòàòôó°ó±ó²ó³ó´óµó¶ó·ó¸óÍóßóõóö\n"
	"±·¶Ã·¥»¾½±Ã­Ï¸Ñ·Ñ¸Ñ¿ÓõÖÜÖİ×¾ØôÚºßÓáÈáÉáıãºãÕãæäÆäÜäİäøäûåõæ¤æ´æå"
	"çãéÇêÆë¦ëµë¶ì¦ìÛìŞíµí¶í·íàïÈïÉğÉğÊğçğüñÃñáñâò¤òÍòáòâòãòäó¹óºó÷óø"
	"óü\n"
	"³ï´Õ½²ËğÎÚÎÛÏÉÖŞØøÙøÚ»Ú¼ÚÎİ³áşäŞäàå÷åøåùæ¥êÃë§ì§ì¨í¸íáíâî¶ïÊïËïÌ"
	"ïÍïÔğÔğéğíğıñãñäñññòñóñôò¥òåó»ó¼ó½ó¾ó×óà\n"
	"ºíÂëÓöÓ÷â¡âàåûæ³çæêÄêÅêÍë·ì©ìªì«ì¬íÁîÖïÎğËğÌğÍğÎğèğşñåò¦ò¶òæòçó¿"
	"óçóùóúóû\n"
	"±µ×¬Ú°ßÔäáäüçÈêÇë«íºî×ïĞïÑğÏñ¡ò§óÅóÔóè\n"
	"İ´âáì­í¹ïÒñæò­òèóá\n"
	"ïÓïÕïÖñ¢ñ£ñçñèòéóâ\n"
	"åüï×ïØñéóÀ\n"
	"İµİ¶à¦ñëóÁ\n"
	"ñêóÂ\n" )
  "SEIMEI-KANJI-KAKUSUU-LIST*" )
